app/views/blog/posts/_post.html.erb

      <h4 class="card-title"><%= link_to post.title, post %></h4>
      <p><%= simple_format post.tags.map {|t| link_to t.name, posts_path(tag: t.name)}.join(', ') %></p>
---
SELECT "tags".* FROM "tags" WHERE (LOWER(name) = LOWER('romantic'))