app/controllers/authors/accounts_controller.rb

UPDATE "authors" SET "name" = $1, "updated_at" = $2 WHERE "authors"."id" = $3  [["name", "Pranjal Prakash Srivastava"], ["updated_at", 2017-03-26 01:32:59 UTC], ["id", 1]]
---
    def update_info
      if current_author.update(author_info_params)

UPDATE "authors" SET "encrypted_password" = $1, "updated_at" = $2 WHERE "authors"."id" = $3  [["encrypted_password", "$2a$11$BTjU6/8b00jXt56JDcg1UON0GGinBp3q9Cl9qWtGfMjk.DzsyNEqi"], ["updated_at", 2017-03-26 02:19:12 UTC], ["id", 1]]
---
    def change_password
      #password or confirmation password is blank
      #password or confirmation don't match
      if current_author.valid_password?(author_password_params[:current_password])
         if current_author.update(
             password: author_password_params[:new_password],
             password_confirmation: author_password_params[:new_password_confirmation])