app/controllers/authors/posts_controller.rb

INSERT INTO "posts" ("title", "body", "description", "slug", "created_at", "updated_at", "banner_image_url", "author_id") VALUES ($1, $2, $3, $4, $5, $6, $7, $8) RETURNING "id"
---
    def create
      @post = current_author.posts.new(post_params)

      respond_to do |format|
        if @post.save

UPDATE "posts" SET "title" = ?, "slug" = ?, "updated_at" = ? WHERE "posts"."id" = ?  [["title", "Share Time Together!!"], ["slug", "share-time-together"], ["updated_at", 2017-03-03 17:58:08 UTC], ["id", 10]]
---
    def update
      respond_to do |format|
        if @post.update(post_params)

SELECT "posts".* FROM "posts" WHERE "posts"."author_id" = ? ORDER BY "posts"."id" DESC  [["author_id", 1]]
---
    def set_post
      @post = current_author.posts.friendly.find(params[:id])