app/controllers/blog/posts_controller.rb

SELECT "posts".* FROM "posts" ORDER BY "posts"."id" DESC
---
    def index
     @posts = Post.all